Infineon/mtb-example-psoc-edge-gfx-lvgl-demo/proj_cm55/main.c
        /* Enable GFX DC interrupt in NVIC. */
        NVIC_EnableIRQ(GFXSS_DC_IRQ);

        /* Initialize GFX GPU interrupt */
        sysint_status = Cy_SysInt_Init(&gpu_irq_cfg, gpu_irq_handler);

        if (CY_SYSINT_SUCCESS != sysint_status)
        {
            printf("Error in registering GPU interrupt: %d\r\n", sysint_status);
            handle_app_error();
        }

        /* Enable GPU interrupt */
        Cy_GFXSS_Enable_GPU_Interrupt(GFXSS);

        /* Enable GFX GPU interrupt in NVIC. */
        NVIC_EnableIRQ(GFXSS_GPU_IRQ);

        /* Initialize the I2C in controller mode. */
        i2c_result = Cy_SCB_I2C_Init(DISPLAY_I2C_CONTROLLER_HW,
                                     &DISPLAY_I2C_CONTROLLER_config,
                                     &disp_touch_i2c_controller_context);

        if (CY_SCB_I2C_SUCCESS != i2c_result)
        {
            printf("I2C controller initialization failed !!\n");
            handle_app_error();
        }

        /* Initialize the I2C interrupt */
        sysint_status = Cy_SysInt_Init(&disp_touch_i2c_controller_irq_cfg,
                                       &disp_touch_i2c_controller_interrupt);

        if (CY_SYSINT_SUCCESS != sysint_status)
        {
            printf("I2C controller interrupt initialization failed\r\n");
            handle_app_error();
        }

        /* Enable the I2C interrupts. */
        NVIC_EnableIRQ(disp_touch_i2c_controller_irq_cfg.intrSrc);

        /* Enable the I2C */
        Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);

        vTaskDelay(pdMS_TO_TICKS(500));

#if defined(MTB_DISPLAY_WS7P0DSI_RPI)
        /* Initialize the RPI display */
        status = mtb_disp_ws7p0dsi_panel_init(DISPLAY_I2C_CONTROLLER_HW,
                                              &disp_touch_i2c_controller_context);

        if (CY_RSLT_SUCCESS != status)
        {
            printf("Waveshare 7-Inch R-Pi display init failed with status = %u\r\n", (unsigned int) status);
            CY_ASSERT(0);
        }

#elif defined(MTB_DISPLAY_EK79007AD3)
        /* Initialize the WF101JTYAHMNB0 display driver. */
        mipi_status = mtb_display_ek79007ad3_init(GFXSS_GFXSS_MIPIDSI,
                                                  &ek79007ad3_pin_cfg);

        if (CY_MIPIDSI_SUCCESS != mipi_status)
        {
            printf("WF101JTYAHMNB0 10-inch display init failed with status = %d\r\n", mipi_status);
            CY_ASSERT(0);
        }

#elif defined(MTB_DISPLAY_W4P3INCH_RPI)

        i2c_result = Cy_SCB_I2C_Init(DISPLAY_I2C_CONTROLLER_HW,
                                     &DISPLAY_I2C_CONTROLLER_config,
                                     &disp_touch_i2c_controller_context);

        if (CY_SCB_I2C_SUCCESS != i2c_result)
        {
            printf("I2C controller initialization failed !!\n");
            CY_ASSERT(0);
        }

        /* Initialize the I2C interrupt */
        sysint_status = Cy_SysInt_Init(&disp_touch_i2c_controller_irq_cfg,
                                       &disp_touch_i2c_controller_interrupt);

        if (CY_SYSINT_SUCCESS != sysint_status)
        {
            printf("I2C controller interrupt initialization failed\r\n");
            CY_ASSERT(0);
        }

        /* Enable the I2C interrupts. */
        NVIC_EnableIRQ(disp_touch_i2c_controller_irq_cfg.intrSrc);

        /* Enable the I2C */
        Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);

         /* Initialize the Waveshare 4.3-Inch display */
        i2c_result = mtb_disp_waveshare_4p3_init(DISPLAY_I2C_CONTROLLER_HW,
                                             &disp_touch_i2c_controller_context);
        if (CY_SCB_I2C_SUCCESS != i2c_result)
        {
            printf("Waveshare 4.3-Inch display init failed with status = %u\r\n", (unsigned int) i2c_result);
            CY_ASSERT(0);
        }

#elif defined(MTB_DISPLAY_R4INCH_TFT)
        /* Initialize the R4INCH display */
        status = mtb_display_st7701s_init(GFXSS_GFXSS_MIPIDSI, &st7701s_backlight_cfg);
        if(CY_RSLT_SUCCESS  != status)
        {
            printf("st7701s 4-inch display init failed with status = %u\r\n", (unsigned int) status);
            CY_ASSERT(0);
        }

        /* Set backlight brightness to 80% */
        uint8_t brightness_level = 80U;
        mtb_display_st7701s_set_brightness(brightness_level);
#endif
        /* Allocate memory for VGLite from the vglite_heap_base */
        vg_module_parameters_t vg_params;
        vg_params.register_mem_base = (uint32_t)GFXSS_GFXSS_GPU_GCNANO;
        vg_params.gpu_mem_base[VG_PARAMS_POS] = GPU_MEM_BASE;
        vg_params.contiguous_mem_base[VG_PARAMS_POS] = vglite_heap_base;
        vg_params.contiguous_mem_size[VG_PARAMS_POS] = VGLITE_HEAP_SIZE;

        /* Initialize VGlite memory. */
        vg_lite_init_mem(&vg_params);

        /* Initialize the memory and data structures needed for VGLite draw/blit
         * functions
         */
        vglite_status = vg_lite_init((MY_DISP_HOR_RES),
                             (MY_DISP_VER_RES));

        if (VG_LITE_SUCCESS == vglite_status)
        {
            /* Initialize LVGL library */
            lv_init();
            lv_port_disp_init();

#if LV_USE_DEMO_BENCHMARK
            /* Run the Benchmark demo */
            lv_demo_benchmark();

            /* Poll for the benchmark summary table
             * Once detected, touch input is re-enabled and
             * this timer is deleted. */
            lv_timer_create(check_benchmark_done_cb, BENCHMARK_DONE_CHECK_PERIOD_MS, NULL);
#else
            /* Initialize touch input. Skipped during benchmark to avoid the
             * CPU overhead of polling-mode touch. */
            lv_port_indev_init();

            /* Run the Music demo */
            lv_demo_music();
#endif
        }
        else
        {
            printf("vg_lite_init failed, status: %d\r\n", vglite_status);

            /* Deallocate all the resources and free up all the memory */
            vg_lite_close();
            handle_app_error();
        }
    }
    else
    {
        printf("Graphics subsystem init failed, status: %d\r\n", gfx_status);
        handle_app_error();
    }

    for (;;)
    {
        /* LVGL's timer handler function, to be called periodically to handle
         * LVGL tasks.
         */
        time_till_next = lv_timer_handler();
        vTaskDelay(pdMS_TO_TICKS(time_till_next));
    }
}

